a = b = 2  # Пример множественного оператора присваивания.
# Обратите внимание на значения переменных a и b после выполнения данной операции.

print("a = " + str(a))  # Функция str() используется для приведения типа аргумента к строковому

print("b = " + "str(b)")

hello = "Пока"

print("bye = " + str(hello))

# Переопределите значение переменной hello
hello = 'Здравствуй'
print("hello = " + str(hello))

# Создайте ещё несколько переменных, а затем осуществите их вывод через пробел
var1 = var2 = var3 = 'Что'
print(var1, var2, var3)
