### 1. Напишите синтаксис цикла `for`? Опишите семантику оператора.
   ```python
   for o in something:
         print('Hello, World!')
   ```
   `o` - переменная принимающая все значения из итерируемого объекта `something`
   
   Цикл перебирает всё элементы объекта, выполняя описанные внутри цикла действия 
       
### 2. Напишите синтаксис цикла `while`? Опишите семантику оператора.
    
   ```python
    while Boolean:
        print('Hello, World!')
```
   `Boolean` - объект, принимающий значения `True` и `False`
    Цикл выполняется, пока значение `Boolean` принимает значение `True`

### 3. Каким образом модуль подключается к программе? 

   С помощью команды `import module_name`

### 4. Поясните значение строки программы: `if __name__ == "__main__": `.

   Условие выполняется, если файл в котором оно написано запускается как основная программа.

### 5. Что такое `__name__`, `__main__`? 
    
   `__name__` - особая переменная, которая изменяется в зависимости от того каким образом запущен файл  
   `__main__` - значение, которое присваивается интерпритатором переменной `__name__`, если файл запущен как основная программа


### 6. Каким образом можно открыть файл на чтение? на запись?
   
   Открытие файла происходит с помощью функции `open(name, mode)`, в качестве второго аргумента можно указать `'r'` для открытия файла на чтение и `'w'` для открытия на запись
   
### 7. Что произойдет, если мы с помощью функции `open` попробуем открыть несуществующий файл? 

Если открыть в режиме чтения, то возникнет ошибка `FileNotFoundError`  
Если открыть в режиме записи, то он будет создан

### 8. Определите значение переменной S после выполнения следующих операторов: 
   1
   ```python
    s=0 
    i=0 
    while i<5 : 
        i+=1 
    s+=1/i
   ```
Ответ: `s = 0.2`

   2
   ```python
    s=0 
    i=1 
    while i>1 : 
         s=s+1/i 
      i=i-1 
```
Ответ: `s = 0`

   3
   ```python
    s=1 
    n=1 
    for i in range(2, n) : 
       s=s+1/i
```
Ответ: `s = 1`
